Repository: reith/control-c
Catalog: prepare/cc_*.po
Languages: fa

source: Sorry, Communication with server faileds.
fa: متاسفانه ارتباط با سرور برقرار نشد.

source: Please wait...
fa: لطفا صبر کنید...

source: Sign out
fa: خروج

source: Login
fa: ورود

source: Register
fa: ثبت نام

source: Server time
fa: زمان سرور

source: Online Compiler
fa: کمپایلر آنلاین

source: Exercises
fa: تمرینات

source: Courses
fa: دروس

source: Students
fa: دانشجوها

source: Students Logs
fa: کارنامه دانشجوها

source: Membership Requests
fa: درخواست‌های عضویت

source: Manage Teachers
fa: مدیریت اساتید

source: Archive
fa: آرشیو

source: Search for exercises
fa: جستجوی تمرینات

source: Single Exercises
fa: تمرینات مجزا

source: Exercise Series
fa: سری تمرینات

source: New
fa: جدید

source: Old
fa: قدیمی

source: All
fa: همه

source: and
fa: و

source: Solved
fa: حل شده

source: Not Solved
fa: حل نشده

source: In
fa: در

source: All Courses
fa: همه دروس

source: Registered Courses
fa: دروس ثبت شده

source: Sorted On
fa: مرتب شده بر اساس

source: Exercise Seri
fa: سری تمرین

source: Course Name
fa: نام درس

source: Creation date
fa: زمان ساخت

source: Deadline Date
fa: مهلت تحویل

source: Course Status
fa: وضعیت درس

source: By
fa: به صورت

source: Ascending
fa: صعودی

source: Descending
fa: نزولی

source: This page doesn't rendered good in your browser. try to upgrade it.
fa: این صفحه در مرورگر شما به خوبی نمایش داده نمی‌شود. لطفا آن را بروز کنید.

source: Sign up
fa: ثبت نام

source: Student Nmber
fa: شماره دانشجویی

source: First Name
fa: نام

source: Last Name
fa: نام خانوادگی

source: E-mail
fa: پست الکترونیک

source: Username
fa: نام کاربری

source: Password
fa: گذرواژه

source: Repeat Password
fa: تکرار گذرواژه

source: Group
fa: گروه کاربری

source: Student
fa: دانشجو

source: Contestant
fa: شرکت کننده در مسابقه

source: Teacher
fa: استاد

source: Contest Admin
fa: برگزار کننده مسابقه

source: Please enter the code in the image
fa: لطفا کد نمایش داده شده در تصویر را وارد کنید

source: Have not any account yet?
fa: هنوز حساب باز نکرده‌اید؟

source: Forgot your password?
fa: گذرواژه حساب‌تان را فراموش کرده‌اید؟

source: Password recovery
fa: بازیابی گذرواژه

source: Password Recovery
fa: بازیابی گذرواژه

source: Please enter your E-mail address
fa: لطفا آدرس پست الکترونیک‌تان را وارد کنید

source: Send
fa: بفرست

source: Note
fa: توجه

source: Your program must be valid for ^C standard compilers. So consider compiling your code with our compilers before submitting it.
fa: ملاک تصحیح برنامه‌های شما، خروجی گرفتن از کمپایلر معتبر برای C^ است. پس در نظر داشته باشید برنامه‌های خود را قبل از ارسال با این کمپایلرها تست کنید.

source: Insert your code
fa: کد را وارد کنید

source: Select the file
fa: فایل کد را انتخاب کنید

source: Programming Language
fa: زبان برنامه‌نویسی

source: Continue to
fa: ادامه تا مرحله

source: Show
fa: نمایش

source: Errors
fa: خطاها

source: Warnings
fa: اخطارها

source: Assembly Code
fa: کد اسمبلی

source: Do
fa: انجام

source: JavaScript support must be enabled..
fa: پشتیبانی از جاوااسکریپت باید فعال باشد

source: You shoud select a source file if your code is wrote in Java
fa: برای کدهای نوشته شده با زبان جاوا، باید فایل کد را ارسال کنید

source: Number of Records each page
fa: تعداد نتایج در هر صفحه

source: Previous
fa: قبل

source: Next
fa: بعد

source: Welcome!
fa: خوش آمدید!

source: Not received
fa: دریافت نشده

source: Not graded
fa: تصحیح نشده

source: Cheat
fa: تقلب

source: No Zip archive received
fa: کدی دریافت نشد

source: Zipped file was corrupted
fa: فایل زیپ شده خراب است

source: Total Seri Grade
fa: نمره کل سری

source: Cheat detected
fa: تقلب تشخیص داده شد

source: Exercise Grade
fa: نمره تمرین

source: Compile Error
fa: خطای کمپایل

source: No
fa: خیر

source: Yes
fa: بله

source: Runtime duration
fa: مدت اجرا

source: Runtime Error
fa: خطای زمان اجرا

source: For test-case(s)
fa: برای موارد

source: Please wait
fa: لطفا صبر کنید

source: Exercises were not graded yet
fa: تمرینات هنوز تصحیح نشده‌اند

source: You can send your homework in Exercise Seri section
fa: شما می‌توانید تمریناتتان را از قسمت سری تمرینات بفرستید

source: Select your zipped archive
fa: فایل زیپ تمریناتتان را انتخاب کنید

source: Your codes are received
fa: کدهای شما دریافت شده

source: Do you want send them again? Ok, select your zipped archive
fa: آیا می‌خواهید دوباره بفرستید؟ فایل زیپ را انتخاب کنید

source: You cannot send your codes, because you are not a member yet
fa: شما نمی‌توانید تمرینی بفرستید، چون هنوز عضو این درس نیستید.

source: You have banned from this course
fa: عضویت شما در این درس مسدود شده است

source: You are not member yet
fa: شما هنوز عضو این درس نیستید

source: An error occurred. it's logged.
fa: خطایی رخ داد. خط ثبت شد.

source: A mail schedulated to be sent.. that contains a link to change your password
fa: یک پست الکترونیک برای شما ارسال خواهد شد.. این پست حاوی لینکی برای تغییر رمز عبور شماست.

source: ID
fa: شناسه

source: Seri
fa: سری

source: Exercise
fa: تمرین

source: Course
fa: درس

source: Creation Date
fa: زمان ساخت

source: Expired
fa: منقضی

source: No source code received
fa: کدی دریافت نشد

source: No file selected
fa: فایلی انتخاب نشده

source: Compiled Successfully
fa: با موفقیت کمپایل شد

source: Produced Code size
fa: سایز کد تولید شده

source: Bytes
fa: بایت

source: Your program has errors.. please fix the errors before send
fa: برنامه شما برای ارسال مناسب نیست.. لطفا قبل از ارسال؛ خطاها را بر طرف کنید.

source: Compiler messages
fa: پیغام‌های کمپایلر

source: You must login again
fa: شما باید دوباره وارد شوید

source: You have NOT sufficient privilege to do this
fa: مجوز دسترسی شما برای این‌کار کافی نیست

source: Data received is invalid
fa: اطلاعات معتبر دریافت نشد

source: Security Code you entered is not true
fa: کد امنیتی صحیح وارد نشده است

source: Error in Database connection
fa: در برقراری ارتباط با پایگاه داده خطا رخ داد

source: Please fill the form
fa: فرم را پر کنید

source: Password is not same as repeated password
fa: کلمه عبور با تکرار آن مطابقت ندارد.

source: Error in Database queries
fa: متاسفانه در اجرای کدهای پایگاه داده خطا رخ داد

source: Error had been logged and probaby be fixed soon
fa: خطا ثبت شد و احتمالا به زودی برطرف می‌شود

source: Authentication failed
fa: مشخصات صحیح نیست

source: No change made
fa: عملیاتی انجام نشد

source: Exercise file exists
fa: فایل تمرینات موجود است

source: Your account had been locked
fa: اکانت کاربری شما قفل شده است

source: about
fa: درباره

source: Please read the project page:
fa: قبل از شروع به کار، راهنمای پروژه را بخوانید.

source: Student Panel
fa: پنل دانشجو

source: Teacher Panel
fa: پنل استاد

source: Source Code
fa: کد

source: Test-case Input
fa: ورودی نمونه

source: Test-case True Output
fa: خروجی نمونه صحیح

source: Test-case Output
fa: خروجی نمونه

source: Show Exercises
fa: نمایش تمرینات

source: Sorted By
fa: مرتب شده بر اساس

source: Seri Number
fa: شماره سری

source: Enter same password twice
fa: رمز عبور را دوباره وارد کنید

source: You have entered duplicated data
fa: شما اطلاعات تکراری وارد کردید

source: Registeration was successfull
fa: عضویت با موفقیت به پایان رسید

source: You Can't.
fa: شما نمی‌توانید.

source: Changes was successfull
fa: تغییرات موفقیت آمیز اعمال شد.

source: No Changes made. Check your permissions.
fa: تغییری رخ نداد. مجوزهای کاربری‌تان رو بررسی کنید.

source: Teacher Name
fa: استاد

source: Expire
fa: منقضی

source: Lock
fa: قفل

source: Details
fa: جزئیات

source: Year
fa: سال

source: Status
fa: وضعیت درس

source: Registeration
fa: ثبت نام

source: Closed
fa: بسته

source: Open
fa: باز

source: Waiting for verification
fa: منتظر تائید

source: Registered
fa: ثبت شده

source: Doesn't verified
fa: تائید نشد

source: Doesn't Requested
fa: درخواست نشده

source: No file received
fa: دریافت نشده

source: Doesn't graded yet
fa: تصحیح نشده
